Tekla Open API Reference for Tekla Structures 2025
ModelObjectHatchAttributes.AutomaticScaling Property
 Specifies whether automatic scaling is enabled. If disabled, custom scale values will be used (see ScaleX and ScaleY).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool AutomaticScaling { get; set; }
Public Property AutomaticScaling As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelObjectHatchAttributes Class
Tekla.Structures.Drawing Namespace